GopalSaraf/Practicals/PSDL/include/proc/pic16lf18456.inc
// Register: SMT2TMRL
#define SMT2TMRL SMT2TMRL
SMT2TMRL                                 equ 050Ch
// bitfield definitions
SMT2TMRL_TMR_POSN                        equ 0000h
SMT2TMRL_TMR_POSITION                    equ 0000h
SMT2TMRL_TMR_SIZE                        equ 0008h
SMT2TMRL_TMR_LENGTH                      equ 0008h
SMT2TMRL_TMR_MASK                        equ 00FFh
SMT2TMRL_TMR0_POSN                       equ 0000h
SMT2TMRL_TMR0_POSITION                   equ 0000h
SMT2TMRL_TMR0_SIZE                       equ 0001h
SMT2TMRL_TMR0_LENGTH                     equ 0001h
SMT2TMRL_TMR0_MASK                       equ 0001h
SMT2TMRL_TMR1_POSN                       equ 0001h
SMT2TMRL_TMR1_POSITION                   equ 0001h
SMT2TMRL_TMR1_SIZE                       equ 0001h
SMT2TMRL_TMR1_LENGTH                     equ 0001h
SMT2TMRL_TMR1_MASK                       equ 0002h
SMT2TMRL_TMR2_POSN                       equ 0002h
SMT2TMRL_TMR2_POSITION                   equ 0002h
SMT2TMRL_TMR2_SIZE                       equ 0001h
SMT2TMRL_TMR2_LENGTH                     equ 0001h
SMT2TMRL_TMR2_MASK                       equ 0004h
SMT2TMRL_TMR3_POSN                       equ 0003h
SMT2TMRL_TMR3_POSITION                   equ 0003h
SMT2TMRL_TMR3_SIZE                       equ 0001h
SMT2TMRL_TMR3_LENGTH                     equ 0001h
SMT2TMRL_TMR3_MASK                       equ 0008h
SMT2TMRL_TMR4_POSN                       equ 0004h
SMT2TMRL_TMR4_POSITION                   equ 0004h
SMT2TMRL_TMR4_SIZE                       equ 0001h
SMT2TMRL_TMR4_LENGTH                     equ 0001h
SMT2TMRL_TMR4_MASK                       equ 0010h
SMT2TMRL_TMR5_POSN                       equ 0005h
SMT2TMRL_TMR5_POSITION                   equ 0005h
SMT2TMRL_TMR5_SIZE                       equ 0001h
SMT2TMRL_TMR5_LENGTH                     equ 0001h
SMT2TMRL_TMR5_MASK                       equ 0020h
SMT2TMRL_TMR6_POSN                       equ 0006h
SMT2TMRL_TMR6_POSITION                   equ 0006h
SMT2TMRL_TMR6_SIZE                       equ 0001h
SMT2TMRL_TMR6_LENGTH                     equ 0001h
SMT2TMRL_TMR6_MASK                       equ 0040h
SMT2TMRL_TMR7_POSN                       equ 0007h
SMT2TMRL_TMR7_POSITION                   equ 0007h
SMT2TMRL_TMR7_SIZE                       equ 0001h
SMT2TMRL_TMR7_LENGTH                     equ 0001h
SMT2TMRL_TMR7_MASK                       equ 0080h
SMT2TMRL_SMT2TMR_POSN                    equ 0000h
SMT2TMRL_SMT2TMR_POSITION                equ 0000h
SMT2TMRL_SMT2TMR_SIZE                    equ 0008h
SMT2TMRL_SMT2TMR_LENGTH                  equ 0008h
SMT2TMRL_SMT2TMR_MASK                    equ 00FFh
SMT2TMRL_SMT2TMR0_POSN                   equ 0000h
SMT2TMRL_SMT2TMR0_POSITION               equ 0000h
SMT2TMRL_SMT2TMR0_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR0_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR0_MASK                   equ 0001h
SMT2TMRL_SMT2TMR1_POSN                   equ 0001h
SMT2TMRL_SMT2TMR1_POSITION               equ 0001h
SMT2TMRL_SMT2TMR1_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR1_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR1_MASK                   equ 0002h
SMT2TMRL_SMT2TMR2_POSN                   equ 0002h
SMT2TMRL_SMT2TMR2_POSITION               equ 0002h
SMT2TMRL_SMT2TMR2_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR2_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR2_MASK                   equ 0004h
SMT2TMRL_SMT2TMR3_POSN                   equ 0003h
SMT2TMRL_SMT2TMR3_POSITION               equ 0003h
SMT2TMRL_SMT2TMR3_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR3_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR3_MASK                   equ 0008h
SMT2TMRL_SMT2TMR4_POSN                   equ 0004h
SMT2TMRL_SMT2TMR4_POSITION               equ 0004h
SMT2TMRL_SMT2TMR4_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR4_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR4_MASK                   equ 0010h
SMT2TMRL_SMT2TMR5_POSN                   equ 0005h
SMT2TMRL_SMT2TMR5_POSITION               equ 0005h
SMT2TMRL_SMT2TMR5_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR5_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR5_MASK                   equ 0020h
SMT2TMRL_SMT2TMR6_POSN                   equ 0006h
SMT2TMRL_SMT2TMR6_POSITION               equ 0006h
SMT2TMRL_SMT2TMR6_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR6_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR6_MASK                   equ 0040h
SMT2TMRL_SMT2TMR7_POSN                   equ 0007h
SMT2TMRL_SMT2TMR7_POSITION               equ 0007h
SMT2TMRL_SMT2TMR7_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR7_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR7_MASK                   equ 0080h

// Register: SMT2TMRH
#define SMT2TMRH SMT2TMRH
SMT2TMRH                                 equ 050Dh
// bitfield definitions
SMT2TMRH_TMR_POSN                        equ 0000h
SMT2TMRH_TMR_POSITION                    equ 0000h
SMT2TMRH_TMR_SIZE                        equ 0008h
SMT2TMRH_TMR_LENGTH                      equ 0008h
SMT2TMRH_TMR_MASK                        equ 00FFh
SMT2TMRH_TMR8_POSN                       equ 0000h
SMT2TMRH_TMR8_POSITION                   equ 0000h
SMT2TMRH_TMR8_SIZE                       equ 0001h
SMT2TMRH_TMR8_LENGTH                     equ 0001h
SMT2TMRH_TMR8_MASK                       equ 0001h
SMT2TMRH_TMR9_POSN                       equ 0001h
SMT2TMRH_TMR9_POSITION                   equ 0001h
SMT2TMRH_TMR9_SIZE                       equ 0001h
SMT2TMRH_TMR9_LENGTH                     equ 0001h
SMT2TMRH_TMR9_MASK                       equ 0002h
SMT2TMRH_TMR10_POSN                      equ 0002h
SMT2TMRH_TMR10_POSITION                  equ 0002h
SMT2TMRH_TMR10_SIZE                      equ 0001h
SMT2TMRH_TMR10_LENGTH                    equ 0001h
SMT2TMRH_TMR10_MASK                      equ 0004h
SMT2TMRH_TMR11_POSN                      equ 0003h
SMT2TMRH_TMR11_POSITION                  equ 0003h
SMT2TMRH_TMR11_SIZE                      equ 0001h
SMT2TMRH_TMR11_LENGTH                    equ 0001h
SMT2TMRH_TMR11_MASK                      equ 0008h
SMT2TMRH_TMR12_POSN                      equ 0004h
SMT2TMRH_TMR12_POSITION                  equ 0004h
SMT2TMRH_TMR12_SIZE                      equ 0001h
SMT2TMRH_TMR12_LENGTH                    equ 0001h
SMT2TMRH_TMR12_MASK                      equ 0010h
SMT2TMRH_TMR13_POSN                      equ 0005h
SMT2TMRH_TMR13_POSITION                  equ 0005h
SMT2TMRH_TMR13_SIZE                      equ 0001h
SMT2TMRH_TMR13_LENGTH                    equ 0001h
SMT2TMRH_TMR13_MASK                      equ 0020h
SMT2TMRH_TMR14_POSN                      equ 0006h
SMT2TMRH_TMR14_POSITION                  equ 0006h
SMT2TMRH_TMR14_SIZE                      equ 0001h
SMT2TMRH_TMR14_LENGTH                    equ 0001h
SMT2TMRH_TMR14_MASK                      equ 0040h
SMT2TMRH_TMR15_POSN                      equ 0007h
SMT2TMRH_TMR15_POSITION                  equ 0007h
SMT2TMRH_TMR15_SIZE                      equ 0001h
SMT2TMRH_TMR15_LENGTH                    equ 0001h
SMT2TMRH_TMR15_MASK                      equ 0080h
SMT2TMRH_SMT2TMR_POSN                    equ 0000h
SMT2TMRH_SMT2TMR_POSITION                equ 0000h
SMT2TMRH_SMT2TMR_SIZE                    equ 0008h
SMT2TMRH_SMT2TMR_LENGTH                  equ 0008h
SMT2TMRH_SMT2TMR_MASK                    equ 00FFh
SMT2TMRH_SMT2TMR8_POSN                   equ 0000h
SMT2TMRH_SMT2TMR8_POSITION               equ 0000h
SMT2TMRH_SMT2TMR8_SIZE                   equ 0001h
SMT2TMRH_SMT2TMR8_LENGTH                 equ 0001h
SMT2TMRH_SMT2TMR8_MASK                   equ 0001h
SMT2TMRH_SMT2TMR9_POSN                   equ 0001h
SMT2TMRH_SMT2TMR9_POSITION               equ 0001h
SMT2TMRH_SMT2TMR9_SIZE                   equ 0001h
SMT2TMRH_SMT2TMR9_LENGTH                 equ 0001h
SMT2TMRH_SMT2TMR9_MASK                   equ 0002h
SMT2TMRH_SMT2TMR10_POSN                  equ 0002h
SMT2TMRH_SMT2TMR10_POSITION              equ 0002h
SMT2TMRH_SMT2TMR10_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR10_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR10_MASK                  equ 0004h
SMT2TMRH_SMT2TMR11_POSN                  equ 0003h
SMT2TMRH_SMT2TMR11_POSITION              equ 0003h
SMT2TMRH_SMT2TMR11_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR11_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR11_MASK                  equ 0008h
SMT2TMRH_SMT2TMR12_POSN                  equ 0004h
SMT2TMRH_SMT2TMR12_POSITION              equ 0004h
SMT2TMRH_SMT2TMR12_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR12_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR12_MASK                  equ 0010h
SMT2TMRH_SMT2TMR13_POSN                  equ 0005h
SMT2TMRH_SMT2TMR13_POSITION              equ 0005h
SMT2TMRH_SMT2TMR13_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR13_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR13_MASK                  equ 0020h
SMT2TMRH_SMT2TMR14_POSN                  equ 0006h
SMT2TMRH_SMT2TMR14_POSITION              equ 0006h
SMT2TMRH_SMT2TMR14_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR14_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR14_MASK                  equ 0040h
SMT2TMRH_SMT2TMR15_POSN                  equ 0007h
SMT2TMRH_SMT2TMR15_POSITION              equ 0007h
SMT2TMRH_SMT2TMR15_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR15_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR15_MASK                  equ 0080h

