GopalSaraf/Practicals/PSDL/include/proc/pic16lf18456.inc
// Register: NVMADRH
#define NVMADRH NVMADRH
NVMADRH                                  equ 081Bh
// bitfield definitions
NVMADRH_NVMADRH0_POSN                    equ 0000h
NVMADRH_NVMADRH0_POSITION                equ 0000h
NVMADRH_NVMADRH0_SIZE                    equ 0001h
NVMADRH_NVMADRH0_LENGTH                  equ 0001h
NVMADRH_NVMADRH0_MASK                    equ 0001h
NVMADRH_NVMADRH1_POSN                    equ 0001h
NVMADRH_NVMADRH1_POSITION                equ 0001h
NVMADRH_NVMADRH1_SIZE                    equ 0001h
NVMADRH_NVMADRH1_LENGTH                  equ 0001h
NVMADRH_NVMADRH1_MASK                    equ 0002h
NVMADRH_NVMADRH2_POSN                    equ 0002h
NVMADRH_NVMADRH2_POSITION                equ 0002h
NVMADRH_NVMADRH2_SIZE                    equ 0001h
NVMADRH_NVMADRH2_LENGTH                  equ 0001h
NVMADRH_NVMADRH2_MASK                    equ 0004h
NVMADRH_NVMADRH3_POSN                    equ 0003h
NVMADRH_NVMADRH3_POSITION                equ 0003h
NVMADRH_NVMADRH3_SIZE                    equ 0001h
NVMADRH_NVMADRH3_LENGTH                  equ 0001h
NVMADRH_NVMADRH3_MASK                    equ 0008h
NVMADRH_NVMADRH4_POSN                    equ 0004h
NVMADRH_NVMADRH4_POSITION                equ 0004h
NVMADRH_NVMADRH4_SIZE                    equ 0001h
NVMADRH_NVMADRH4_LENGTH                  equ 0001h
NVMADRH_NVMADRH4_MASK                    equ 0010h
NVMADRH_NVMADRH5_POSN                    equ 0005h
NVMADRH_NVMADRH5_POSITION                equ 0005h
NVMADRH_NVMADRH5_SIZE                    equ 0001h
NVMADRH_NVMADRH5_LENGTH                  equ 0001h
NVMADRH_NVMADRH5_MASK                    equ 0020h
NVMADRH_NVMADRH6_POSN                    equ 0006h
NVMADRH_NVMADRH6_POSITION                equ 0006h
NVMADRH_NVMADRH6_SIZE                    equ 0001h
NVMADRH_NVMADRH6_LENGTH                  equ 0001h
NVMADRH_NVMADRH6_MASK                    equ 0040h

// Register: NVMDATL
#define NVMDATL NVMDATL
NVMDATL                                  equ 081Ch
// bitfield definitions
NVMDATL_NVMDATL0_POSN                    equ 0000h
NVMDATL_NVMDATL0_POSITION                equ 0000h
NVMDATL_NVMDATL0_SIZE                    equ 0001h
NVMDATL_NVMDATL0_LENGTH                  equ 0001h
NVMDATL_NVMDATL0_MASK                    equ 0001h
NVMDATL_NVMDATL1_POSN                    equ 0001h
NVMDATL_NVMDATL1_POSITION                equ 0001h
NVMDATL_NVMDATL1_SIZE                    equ 0001h
NVMDATL_NVMDATL1_LENGTH                  equ 0001h
NVMDATL_NVMDATL1_MASK                    equ 0002h
NVMDATL_NVMDATL2_POSN                    equ 0002h
NVMDATL_NVMDATL2_POSITION                equ 0002h
NVMDATL_NVMDATL2_SIZE                    equ 0001h
NVMDATL_NVMDATL2_LENGTH                  equ 0001h
NVMDATL_NVMDATL2_MASK                    equ 0004h
NVMDATL_NVMDATL3_POSN                    equ 0003h
NVMDATL_NVMDATL3_POSITION                equ 0003h
NVMDATL_NVMDATL3_SIZE                    equ 0001h
NVMDATL_NVMDATL3_LENGTH                  equ 0001h
NVMDATL_NVMDATL3_MASK                    equ 0008h
NVMDATL_NVMDATL4_POSN                    equ 0004h
NVMDATL_NVMDATL4_POSITION                equ 0004h
NVMDATL_NVMDATL4_SIZE                    equ 0001h
NVMDATL_NVMDATL4_LENGTH                  equ 0001h
NVMDATL_NVMDATL4_MASK                    equ 0010h
NVMDATL_NVMDATL5_POSN                    equ 0005h
NVMDATL_NVMDATL5_POSITION                equ 0005h
NVMDATL_NVMDATL5_SIZE                    equ 0001h
NVMDATL_NVMDATL5_LENGTH                  equ 0001h
NVMDATL_NVMDATL5_MASK                    equ 0020h
NVMDATL_NVMDATL6_POSN                    equ 0006h
NVMDATL_NVMDATL6_POSITION                equ 0006h
NVMDATL_NVMDATL6_SIZE                    equ 0001h
NVMDATL_NVMDATL6_LENGTH                  equ 0001h
NVMDATL_NVMDATL6_MASK                    equ 0040h
NVMDATL_NVMDATL7_POSN                    equ 0007h
NVMDATL_NVMDATL7_POSITION                equ 0007h
NVMDATL_NVMDATL7_SIZE                    equ 0001h
NVMDATL_NVMDATL7_LENGTH                  equ 0001h
NVMDATL_NVMDATL7_MASK                    equ 0080h

// Register: NVMDATH
#define NVMDATH NVMDATH
NVMDATH                                  equ 081Dh
// bitfield definitions
NVMDATH_NVMDATH0_POSN                    equ 0000h
NVMDATH_NVMDATH0_POSITION                equ 0000h
NVMDATH_NVMDATH0_SIZE                    equ 0001h
NVMDATH_NVMDATH0_LENGTH                  equ 0001h
NVMDATH_NVMDATH0_MASK                    equ 0001h
NVMDATH_NVMDATH1_POSN                    equ 0001h
NVMDATH_NVMDATH1_POSITION                equ 0001h
NVMDATH_NVMDATH1_SIZE                    equ 0001h
NVMDATH_NVMDATH1_LENGTH                  equ 0001h
NVMDATH_NVMDATH1_MASK                    equ 0002h
NVMDATH_NVMDATH2_POSN                    equ 0002h
NVMDATH_NVMDATH2_POSITION                equ 0002h
NVMDATH_NVMDATH2_SIZE                    equ 0001h
NVMDATH_NVMDATH2_LENGTH                  equ 0001h
NVMDATH_NVMDATH2_MASK                    equ 0004h
NVMDATH_NVMDATH3_POSN                    equ 0003h
NVMDATH_NVMDATH3_POSITION                equ 0003h
NVMDATH_NVMDATH3_SIZE                    equ 0001h
NVMDATH_NVMDATH3_LENGTH                  equ 0001h
NVMDATH_NVMDATH3_MASK                    equ 0008h
NVMDATH_NVMDATH4_POSN                    equ 0004h
NVMDATH_NVMDATH4_POSITION                equ 0004h
NVMDATH_NVMDATH4_SIZE                    equ 0001h
NVMDATH_NVMDATH4_LENGTH                  equ 0001h
NVMDATH_NVMDATH4_MASK                    equ 0010h
NVMDATH_NVMDATH5_POSN                    equ 0005h
NVMDATH_NVMDATH5_POSITION                equ 0005h
NVMDATH_NVMDATH5_SIZE                    equ 0001h
NVMDATH_NVMDATH5_LENGTH                  equ 0001h
NVMDATH_NVMDATH5_MASK                    equ 0020h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 081Eh
// bitfield definitions
NVMCON1_RD_POSN                          equ 0000h
NVMCON1_RD_POSITION                      equ 0000h
NVMCON1_RD_SIZE                          equ 0001h
NVMCON1_RD_LENGTH                        equ 0001h
NVMCON1_RD_MASK                          equ 0001h
NVMCON1_WR_POSN                          equ 0001h
NVMCON1_WR_POSITION                      equ 0001h
NVMCON1_WR_SIZE                          equ 0001h
NVMCON1_WR_LENGTH                        equ 0001h
NVMCON1_WR_MASK                          equ 0002h
NVMCON1_WREN_POSN                        equ 0002h
NVMCON1_WREN_POSITION                    equ 0002h
NVMCON1_WREN_SIZE                        equ 0001h
NVMCON1_WREN_LENGTH                      equ 0001h
NVMCON1_WREN_MASK                        equ 0004h
NVMCON1_WRERR_POSN                       equ 0003h
NVMCON1_WRERR_POSITION                   equ 0003h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0008h
NVMCON1_FREE_POSN                        equ 0004h
NVMCON1_FREE_POSITION                    equ 0004h
NVMCON1_FREE_SIZE                        equ 0001h
NVMCON1_FREE_LENGTH                      equ 0001h
NVMCON1_FREE_MASK                        equ 0010h
NVMCON1_LWLO_POSN                        equ 0005h
NVMCON1_LWLO_POSITION                    equ 0005h
NVMCON1_LWLO_SIZE                        equ 0001h
NVMCON1_LWLO_LENGTH                      equ 0001h
NVMCON1_LWLO_MASK                        equ 0020h
NVMCON1_NVMREGS_POSN                     equ 0006h
NVMCON1_NVMREGS_POSITION                 equ 0006h
NVMCON1_NVMREGS_SIZE                     equ 0001h
NVMCON1_NVMREGS_LENGTH                   equ 0001h
NVMCON1_NVMREGS_MASK                     equ 0040h

// Register: NVMCON2
#define NVMCON2 NVMCON2
NVMCON2                                  equ 081Fh
// bitfield definitions
NVMCON2_NVMCON2_POSN                     equ 0000h
NVMCON2_NVMCON2_POSITION                 equ 0000h
NVMCON2_NVMCON2_SIZE                     equ 0008h
NVMCON2_NVMCON2_LENGTH                   equ 0008h
NVMCON2_NVMCON2_MASK                     equ 00FFh

