GopalSaraf/Practicals/PSDL/include/proc/pic16lf18456.inc
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4
#define SMT2AS                           BANKMASK(SMT2STAT), 0
#define SMT2CPOL                         BANKMASK(SMT2CON0), 2
#define SMT2CPR0                         BANKMASK(SMT2CPRL), 0
#define SMT2CPR1                         BANKMASK(SMT2CPRL), 1
#define SMT2CPR10                        BANKMASK(SMT2CPRH), 2
#define SMT2CPR11                        BANKMASK(SMT2CPRH), 3
#define SMT2CPR12                        BANKMASK(SMT2CPRH), 4
#define SMT2CPR13                        BANKMASK(SMT2CPRH), 5
#define SMT2CPR14                        BANKMASK(SMT2CPRH), 6
#define SMT2CPR15                        BANKMASK(SMT2CPRH), 7
#define SMT2CPR16                        BANKMASK(SMT2CPRU), 0
#define SMT2CPR17                        BANKMASK(SMT2CPRU), 1
#define SMT2CPR18                        BANKMASK(SMT2CPRU), 2
#define SMT2CPR19                        BANKMASK(SMT2CPRU), 3
#define SMT2CPR2                         BANKMASK(SMT2CPRL), 2
#define SMT2CPR20                        BANKMASK(SMT2CPRU), 4
#define SMT2CPR21                        BANKMASK(SMT2CPRU), 5
#define SMT2CPR22                        BANKMASK(SMT2CPRU), 6
#define SMT2CPR23                        BANKMASK(SMT2CPRU), 7
#define SMT2CPR3                         BANKMASK(SMT2CPRL), 3
#define SMT2CPR4                         BANKMASK(SMT2CPRL), 4
#define SMT2CPR5                         BANKMASK(SMT2CPRL), 5
#define SMT2CPR6                         BANKMASK(SMT2CPRL), 6
#define SMT2CPR7                         BANKMASK(SMT2CPRL), 7
#define SMT2CPR8                         BANKMASK(SMT2CPRH), 0
#define SMT2CPR9                         BANKMASK(SMT2CPRH), 1
#define SMT2CPRUP                        BANKMASK(SMT2STAT), 7
#define SMT2CPW0                         BANKMASK(SMT2CPWL), 0
#define SMT2CPW1                         BANKMASK(SMT2CPWL), 1
#define SMT2CPW10                        BANKMASK(SMT2CPWH), 2
#define SMT2CPW11                        BANKMASK(SMT2CPWH), 3
#define SMT2CPW12                        BANKMASK(SMT2CPWH), 4
#define SMT2CPW13                        BANKMASK(SMT2CPWH), 5
#define SMT2CPW14                        BANKMASK(SMT2CPWH), 6
#define SMT2CPW15                        BANKMASK(SMT2CPWH), 7
#define SMT2CPW16                        BANKMASK(SMT2CPWU), 0
#define SMT2CPW17                        BANKMASK(SMT2CPWU), 1
#define SMT2CPW18                        BANKMASK(SMT2CPWU), 2
#define SMT2CPW19                        BANKMASK(SMT2CPWU), 3
#define SMT2CPW2                         BANKMASK(SMT2CPWL), 2
#define SMT2CPW20                        BANKMASK(SMT2CPWU), 4
#define SMT2CPW21                        BANKMASK(SMT2CPWU), 5
#define SMT2CPW22                        BANKMASK(SMT2CPWU), 6
#define SMT2CPW23                        BANKMASK(SMT2CPWU), 7
#define SMT2CPW3                         BANKMASK(SMT2CPWL), 3
#define SMT2CPW4                         BANKMASK(SMT2CPWL), 4
#define SMT2CPW5                         BANKMASK(SMT2CPWL), 5
#define SMT2CPW6                         BANKMASK(SMT2CPWL), 6
#define SMT2CPW7                         BANKMASK(SMT2CPWL), 7
#define SMT2CPW8                         BANKMASK(SMT2CPWH), 0
#define SMT2CPW9                         BANKMASK(SMT2CPWH), 1
#define SMT2CPWUP                        BANKMASK(SMT2STAT), 6
#define SMT2CSEL0                        BANKMASK(SMT2CLK), 0
#define SMT2CSEL1                        BANKMASK(SMT2CLK), 1
#define SMT2CSEL2                        BANKMASK(SMT2CLK), 2
#define SMT2EN                           BANKMASK(SMT2CON0), 7
#define SMT2GO                           BANKMASK(SMT2CON1), 7
#define SMT2IE                           BANKMASK(PIE8), 3
#define SMT2IF                           BANKMASK(PIR8), 3
#define SMT2PR0                          BANKMASK(SMT2PRL), 0
#define SMT2PR1                          BANKMASK(SMT2PRL), 1
#define SMT2PR10                         BANKMASK(SMT2PRH), 2
#define SMT2PR11                         BANKMASK(SMT2PRH), 3
#define SMT2PR12                         BANKMASK(SMT2PRH), 4
#define SMT2PR13                         BANKMASK(SMT2PRH), 5
#define SMT2PR14                         BANKMASK(SMT2PRH), 6
#define SMT2PR15                         BANKMASK(SMT2PRH), 7
#define SMT2PR16                         BANKMASK(SMT2PRU), 0
#define SMT2PR17                         BANKMASK(SMT2PRU), 1
#define SMT2PR18                         BANKMASK(SMT2PRU), 2
#define SMT2PR19                         BANKMASK(SMT2PRU), 3
#define SMT2PR2                          BANKMASK(SMT2PRL), 2
#define SMT2PR20                         BANKMASK(SMT2PRU), 4
#define SMT2PR21                         BANKMASK(SMT2PRU), 5
#define SMT2PR22                         BANKMASK(SMT2PRU), 6
#define SMT2PR23                         BANKMASK(SMT2PRU), 7
#define SMT2PR3                          BANKMASK(SMT2PRL), 3
#define SMT2PR4                          BANKMASK(SMT2PRL), 4
#define SMT2PR5                          BANKMASK(SMT2PRL), 5
#define SMT2PR6                          BANKMASK(SMT2PRL), 6
#define SMT2PR7                          BANKMASK(SMT2PRL), 7
#define SMT2PR8                          BANKMASK(SMT2PRH), 0
#define SMT2PR9                          BANKMASK(SMT2PRH), 1
#define SMT2PRAIE                        BANKMASK(PIE8), 4
#define SMT2PRAIF                        BANKMASK(PIR8), 4
#define SMT2PS0                          BANKMASK(SMT2CON0), 0
#define SMT2PS1                          BANKMASK(SMT2CON0), 1
#define SMT2PWAIE                        BANKMASK(PIE8), 5
#define SMT2PWAIF                        BANKMASK(PIR8), 5
#define SMT2REPEAT                       BANKMASK(SMT2CON1), 6
#define SMT2RESET                        BANKMASK(SMT2STAT), 5
#define SMT2RST                          BANKMASK(SMT2STAT), 5
#define SMT2SIGPPS0                      BANKMASK(SMT2SIGPPS), 0
#define SMT2SIGPPS1                      BANKMASK(SMT2SIGPPS), 1
#define SMT2SIGPPS2                      BANKMASK(SMT2SIGPPS), 2
#define SMT2SIGPPS3                      BANKMASK(SMT2SIGPPS), 3
#define SMT2SIGPPS4                      BANKMASK(SMT2SIGPPS), 4
#define SMT2SPOL                         BANKMASK(SMT2CON0), 3
#define SMT2SSEL0                        BANKMASK(SMT2SIG), 0
#define SMT2SSEL1                        BANKMASK(SMT2SIG), 1
#define SMT2SSEL2                        BANKMASK(SMT2SIG), 2
#define SMT2SSEL3                        BANKMASK(SMT2SIG), 3
#define SMT2SSEL4                        BANKMASK(SMT2SIG), 4
#define SMT2STP                          BANKMASK(SMT2CON0), 5
#define SMT2TMR0                         BANKMASK(SMT2TMRL), 0
#define SMT2TMR1                         BANKMASK(SMT2TMRL), 1
#define SMT2TMR10                        BANKMASK(SMT2TMRH), 2
#define SMT2TMR11                        BANKMASK(SMT2TMRH), 3
#define SMT2TMR12                        BANKMASK(SMT2TMRH), 4
#define SMT2TMR13                        BANKMASK(SMT2TMRH), 5
#define SMT2TMR14                        BANKMASK(SMT2TMRH), 6
#define SMT2TMR15                        BANKMASK(SMT2TMRH), 7
#define SMT2TMR16                        BANKMASK(SMT2TMRU), 0
#define SMT2TMR17                        BANKMASK(SMT2TMRU), 1
#define SMT2TMR18                        BANKMASK(SMT2TMRU), 2
#define SMT2TMR19                        BANKMASK(SMT2TMRU), 3
#define SMT2TMR2                         BANKMASK(SMT2TMRL), 2
#define SMT2TMR20                        BANKMASK(SMT2TMRU), 4
#define SMT2TMR21                        BANKMASK(SMT2TMRU), 5
#define SMT2TMR22                        BANKMASK(SMT2TMRU), 6
#define SMT2TMR23                        BANKMASK(SMT2TMRU), 7
#define SMT2TMR3                         BANKMASK(SMT2TMRL), 3
#define SMT2TMR4                         BANKMASK(SMT2TMRL), 4
#define SMT2TMR5                         BANKMASK(SMT2TMRL), 5
#define SMT2TMR6                         BANKMASK(SMT2TMRL), 6
#define SMT2TMR7                         BANKMASK(SMT2TMRL), 7
#define SMT2TMR8                         BANKMASK(SMT2TMRH), 0
#define SMT2TMR9                         BANKMASK(SMT2TMRH), 1
#define SMT2TS                           BANKMASK(SMT2STAT), 2
#define SMT2WINPPS0                      BANKMASK(SMT2WINPPS), 0
#define SMT2WINPPS1                      BANKMASK(SMT2WINPPS), 1
#define SMT2WINPPS2                      BANKMASK(SMT2WINPPS), 2
#define SMT2WINPPS3                      BANKMASK(SMT2WINPPS), 3
#define SMT2WINPPS4                      BANKMASK(SMT2WINPPS), 4
#define SMT2WOL                          BANKMASK(SMT2CON0), 4
#define SMT2WS                           BANKMASK(SMT2STAT), 1
#define SMT2WSEL0                        BANKMASK(SMT2WIN), 0
#define SMT2WSEL1                        BANKMASK(SMT2WIN), 1
#define SMT2WSEL2                        BANKMASK(SMT2WIN), 2
#define SMT2WSEL3                        BANKMASK(SMT2WIN), 3
#define SMT2WSEL4                        BANKMASK(SMT2WIN), 4
#define SMU2MD                           BANKMASK(PMD7), 6
#define SOI                              BANKMASK(ADCON3), 3
#define SOR                              BANKMASK(OSCSTAT), 3
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1IE                           BANKMASK(PIE3), 0
#define SSP1IF                           BANKMASK(PIR3), 0
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSP2CLKPPS0                      BANKMASK(SSP2CLKPPS), 0
#define SSP2CLKPPS1                      BANKMASK(SSP2CLKPPS), 1
#define SSP2CLKPPS2                      BANKMASK(SSP2CLKPPS), 2
#define SSP2CLKPPS3                      BANKMASK(SSP2CLKPPS), 3
#define SSP2CLKPPS4                      BANKMASK(SSP2CLKPPS), 4
#define SSP2DATPPS0                      BANKMASK(SSP2DATPPS), 0
#define SSP2DATPPS1                      BANKMASK(SSP2DATPPS), 1
#define SSP2DATPPS2                      BANKMASK(SSP2DATPPS), 2
#define SSP2DATPPS3                      BANKMASK(SSP2DATPPS), 3
#define SSP2DATPPS4                      BANKMASK(SSP2DATPPS), 4
#define SSP2IE                           BANKMASK(PIE3), 2
#define SSP2IF                           BANKMASK(PIR3), 2
#define SSP2SSPPS0                       BANKMASK(SSP2SSPPS), 0
#define SSP2SSPPS1                       BANKMASK(SSP2SSPPS), 1
#define SSP2SSPPS2                       BANKMASK(SSP2SSPPS), 2
#define SSP2SSPPS3                       BANKMASK(SSP2SSPPS), 3
#define SSP2SSPPS4                       BANKMASK(SSP2SSPPS), 4
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPEN2                           BANKMASK(SSP2CON1), 5
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM02                           BANKMASK(SSP2CON1), 0
#define SSPM11                           BANKMASK(SSP1CON1), 1
#define SSPM12                           BANKMASK(SSP2CON1), 1
#define SSPM21                           BANKMASK(SSP1CON1), 2
#define SSPM22                           BANKMASK(SSP2CON1), 2
#define SSPM31                           BANKMASK(SSP1CON1), 3
#define SSPM32                           BANKMASK(SSP2CON1), 3
#define SSPOV1                           BANKMASK(SSP1CON1), 6
#define SSPOV2                           BANKMASK(SSP2CON1), 6
#define START1                           BANKMASK(SSP1STAT), 3
#define START2                           BANKMASK(SSP2STAT), 3
#define STAT0                            BANKMASK(ADSTAT), 0
#define STAT1                            BANKMASK(ADSTAT), 1
#define STAT2                            BANKMASK(ADSTAT), 2
#define STATE                            BANKMASK(WDTTMR), 2
#define STKOVF                           BANKMASK(PCON0), 7
#define STKPTR0                          BANKMASK(STKPTR), 0
#define STKPTR1                          BANKMASK(STKPTR), 1
#define STKPTR2                          BANKMASK(STKPTR), 2
#define STKPTR3                          BANKMASK(STKPTR), 3
#define STKPTR4                          BANKMASK(STKPTR), 4
#define STKUNF                           BANKMASK(PCON0), 6
#define STOP1                            BANKMASK(SSP1STAT), 4
#define STOP2                            BANKMASK(SSP2STAT), 4
#define STPT0                            BANKMASK(ADSTPTL), 0
#define STPT1                            BANKMASK(ADSTPTL), 1
#define STPT10                           BANKMASK(ADSTPTH), 2
#define STPT11                           BANKMASK(ADSTPTH), 3
#define STPT12                           BANKMASK(ADSTPTH), 4
#define STPT13                           BANKMASK(ADSTPTH), 5
#define STPT15                           BANKMASK(ADSTPTH), 6
#define STPT16                           BANKMASK(ADSTPTH), 7
#define STPT2                            BANKMASK(ADSTPTL), 2
#define STPT3                            BANKMASK(ADSTPTL), 3
#define STPT4                            BANKMASK(ADSTPTL), 4
#define STPT5                            BANKMASK(ADSTPTL), 5
#define STPT6                            BANKMASK(ADSTPTL), 6
#define STPT7                            BANKMASK(ADSTPTL), 7
#define STPT8                            BANKMASK(ADSTPTH), 0
#define STPT9                            BANKMASK(ADSTPTH), 1
#define SWDTEN                           BANKMASK(WDTCON0), 0
#define SYSCMD                           BANKMASK(PMD0), 7
#define T016BIT                          BANKMASK(T0CON0), 4
#define T0ASYNC                          BANKMASK(T0CON1), 4
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4
#define T0CKPS0                          BANKMASK(T0CON1), 0
#define T0CKPS1                          BANKMASK(T0CON1), 1
#define T0CKPS2                          BANKMASK(T0CON1), 2
#define T0CKPS3                          BANKMASK(T0CON1), 3
#define T0CS0                            BANKMASK(T0CON1), 5
#define T0CS1                            BANKMASK(T0CON1), 6
#define T0CS2                            BANKMASK(T0CON1), 7
#define T0EN                             BANKMASK(T0CON0), 7
#define T0MD16                           BANKMASK(T0CON0), 4
#define T0OUT                            BANKMASK(T0CON0), 5
#define T0PR0                            BANKMASK(TMR0H), 0
#define T0PR1                            BANKMASK(TMR0H), 1
#define T0PR2                            BANKMASK(TMR0H), 2
#define T0PR3                            BANKMASK(TMR0H), 3
#define T0PR4                            BANKMASK(TMR0H), 4
#define T0PR5                            BANKMASK(TMR0H), 5
#define T0PR6                            BANKMASK(TMR0H), 6
#define T0PR7                            BANKMASK(TMR0H), 7
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CLK), 0
#define T1CS1                            BANKMASK(T1CLK), 1
#define T1CS2                            BANKMASK(T1CLK), 2
#define T1CS3                            BANKMASK(T1CLK), 3
#define T1CS4                            BANKMASK(T1CLK), 4
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GPPS0                          BANKMASK(T1GPPS), 0
#define T1GPPS1                          BANKMASK(T1GPPS), 1
#define T1GPPS2                          BANKMASK(T1GPPS), 2
#define T1GPPS3                          BANKMASK(T1GPPS), 3
#define T1GPPS4                          BANKMASK(T1GPPS), 4
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GATE), 0
#define T1GSS1                           BANKMASK(T1GATE), 1
#define T1GSS2                           BANKMASK(T1GATE), 2
#define T1GSS3                           BANKMASK(T1GATE), 3
#define T1GSS4                           BANKMASK(T1GATE), 4
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1RD16                           BANKMASK(T1CON), 1
#define T2CKPOL                          BANKMASK(T2HLT), 6
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CKSYNC                         BANKMASK(T2HLT), 5
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2INPPS0                         BANKMASK(T2INPPS), 0
#define T2INPPS1                         BANKMASK(T2INPPS), 1
#define T2INPPS2                         BANKMASK(T2INPPS), 2
#define T2INPPS3                         BANKMASK(T2INPPS), 3
#define T2INPPS4                         BANKMASK(T2INPPS), 4
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define T2RSEL4                          BANKMASK(T2RST), 4
#define T3CKIPPS0                        BANKMASK(T3CKIPPS), 0
#define T3CKIPPS1                        BANKMASK(T3CKIPPS), 1
#define T3CKIPPS2                        BANKMASK(T3CKIPPS), 2
#define T3CKIPPS3                        BANKMASK(T3CKIPPS), 3
#define T3CKIPPS4                        BANKMASK(T3CKIPPS), 4
#define T3CKPS0                          BANKMASK(T3CON), 4
#define T3CKPS1                          BANKMASK(T3CON), 5
#define T3CS0                            BANKMASK(T3CLK), 0
#define T3CS1                            BANKMASK(T3CLK), 1
#define T3CS2                            BANKMASK(T3CLK), 2
#define T3CS3                            BANKMASK(T3CLK), 3
#define T3CS4                            BANKMASK(T3CLK), 4
#define T3GE                             BANKMASK(T3GCON), 7
#define T3GGO                            BANKMASK(T3GCON), 3
#define T3GPOL                           BANKMASK(T3GCON), 6
#define T3GPPS0                          BANKMASK(T3GPPS), 0
#define T3GPPS1                          BANKMASK(T3GPPS), 1
#define T3GPPS2                          BANKMASK(T3GPPS), 2
#define T3GPPS3                          BANKMASK(T3GPPS), 3
#define T3GPPS4                          BANKMASK(T3GPPS), 4
#define T3GSPM                           BANKMASK(T3GCON), 4
#define T3GSS0                           BANKMASK(T3GATE), 0
#define T3GSS1                           BANKMASK(T3GATE), 1
#define T3GSS2                           BANKMASK(T3GATE), 2
#define T3GSS3                           BANKMASK(T3GATE), 3
#define T3GSS4                           BANKMASK(T3GATE), 4
#define T3GTM                            BANKMASK(T3GCON), 5
#define T3GVAL                           BANKMASK(T3GCON), 2
#define T3RD16                           BANKMASK(T3CON), 1
#define T4CKPOL                          BANKMASK(T4HLT), 6
#define T4CKPS0                          BANKMASK(T4CON), 4
#define T4CKPS1                          BANKMASK(T4CON), 5
#define T4CKPS2                          BANKMASK(T4CON), 6
#define T4CKSYNC                         BANKMASK(T4HLT), 5
#define T4CS0                            BANKMASK(T4CLKCON), 0
#define T4CS1                            BANKMASK(T4CLKCON), 1
#define T4CS2                            BANKMASK(T4CLKCON), 2
#define T4CS3                            BANKMASK(T4CLKCON), 3
#define T4INPPS0                         BANKMASK(T4INPPS), 0
#define T4INPPS1                         BANKMASK(T4INPPS), 1
#define T4INPPS2                         BANKMASK(T4INPPS), 2
#define T4INPPS3                         BANKMASK(T4INPPS), 3
#define T4INPPS4                         BANKMASK(T4INPPS), 4
#define T4MODE0                          BANKMASK(T4HLT), 0
#define T4MODE1                          BANKMASK(T4HLT), 1
#define T4MODE2                          BANKMASK(T4HLT), 2
#define T4MODE3                          BANKMASK(T4HLT), 3
#define T4MODE4                          BANKMASK(T4HLT), 4
#define T4ON                             BANKMASK(T4CON), 7
#define T4OUTPS0                         BANKMASK(T4CON), 0
#define T4OUTPS1                         BANKMASK(T4CON), 1
#define T4OUTPS2                         BANKMASK(T4CON), 2
#define T4OUTPS3                         BANKMASK(T4CON), 3
#define T4PSYNC                          BANKMASK(T4HLT), 7
#define T4RSEL0                          BANKMASK(T4RST), 0
#define T4RSEL1                          BANKMASK(T4RST), 1
#define T4RSEL2                          BANKMASK(T4RST), 2
#define T4RSEL3                          BANKMASK(T4RST), 3
#define T4RSEL4                          BANKMASK(T4RST), 4
#define T5CKIPP3                         BANKMASK(T5CKIPPS), 3
#define T5CKIPPS0                        BANKMASK(T5CKIPPS), 0
#define T5CKIPPS1                        BANKMASK(T5CKIPPS), 1
#define T5CKIPPS2                        BANKMASK(T5CKIPPS), 2
#define T5CKIPPS4                        BANKMASK(T5CKIPPS), 4
#define T5CKPS0                          BANKMASK(T5CON), 4
#define T5CKPS1                          BANKMASK(T5CON), 5
#define T5CS0                            BANKMASK(T5CLK), 0
#define T5CS1                            BANKMASK(T5CLK), 1
#define T5CS2                            BANKMASK(T5CLK), 2
#define T5CS3                            BANKMASK(T5CLK), 3
#define T5CS4                            BANKMASK(T5CLK), 4
#define T5GE                             BANKMASK(T5GCON), 7
#define T5GGO                            BANKMASK(T5GCON), 3
#define T5GPOL                           BANKMASK(T5GCON), 6
#define T5GPPS0                          BANKMASK(T5GPPS), 0
