GopalSaraf/Practicals/PSDL/include/proc/pic16lf18456.inc
#define T5GPPS1                          BANKMASK(T5GPPS), 1
#define T5GPPS2                          BANKMASK(T5GPPS), 2
#define T5GPPS3                          BANKMASK(T5GPPS), 3
#define T5GPPS4                          BANKMASK(T5GPPS), 4
#define T5GSPM                           BANKMASK(T5GCON), 4
#define T5GSS0                           BANKMASK(T5GATE), 0
#define T5GSS1                           BANKMASK(T5GATE), 1
#define T5GSS2                           BANKMASK(T5GATE), 2
#define T5GSS3                           BANKMASK(T5GATE), 3
#define T5GSS4                           BANKMASK(T5GATE), 4
#define T5GTM                            BANKMASK(T5GCON), 5
#define T5GVAL                           BANKMASK(T5GCON), 2
#define T5RD16                           BANKMASK(T5CON), 1
#define T6CKPOL                          BANKMASK(T6HLT), 6
#define T6CKPS0                          BANKMASK(T6CON), 4
#define T6CKPS1                          BANKMASK(T6CON), 5
#define T6CKPS2                          BANKMASK(T6CON), 6
#define T6CKSYNC                         BANKMASK(T6HLT), 5
#define T6CS0                            BANKMASK(T6CLKCON), 0
#define T6CS1                            BANKMASK(T6CLKCON), 1
#define T6CS2                            BANKMASK(T6CLKCON), 2
#define T6CS3                            BANKMASK(T6CLKCON), 3
#define T6INPPS0                         BANKMASK(T6INPPS), 0
#define T6INPPS1                         BANKMASK(T6INPPS), 1
#define T6INPPS2                         BANKMASK(T6INPPS), 2
#define T6INPPS3                         BANKMASK(T6INPPS), 3
#define T6INPPS4                         BANKMASK(T6INPPS), 4
#define T6MODE0                          BANKMASK(T6HLT), 0
#define T6MODE1                          BANKMASK(T6HLT), 1
#define T6MODE2                          BANKMASK(T6HLT), 2
#define T6MODE3                          BANKMASK(T6HLT), 3
#define T6MODE4                          BANKMASK(T6HLT), 4
#define T6ON                             BANKMASK(T6CON), 7
#define T6OUTPS0                         BANKMASK(T6CON), 0
#define T6OUTPS1                         BANKMASK(T6CON), 1
#define T6OUTPS2                         BANKMASK(T6CON), 2
#define T6OUTPS3                         BANKMASK(T6CON), 3
#define T6PSYNC                          BANKMASK(T6HLT), 7
#define T6RSEL0                          BANKMASK(T6RST), 0
#define T6RSEL1                          BANKMASK(T6RST), 1
#define T6RSEL2                          BANKMASK(T6RST), 2
#define T6RSEL3                          BANKMASK(T6RST), 3
#define T6RSEL4                          BANKMASK(T6RST), 4
#define TMD0                             BANKMASK(ADCON3), 0
#define TMD1                             BANKMASK(ADCON3), 1
#define TMD2                             BANKMASK(ADCON3), 2
#define TMR0H0                           BANKMASK(TMR0H), 0
#define TMR0H1                           BANKMASK(TMR0H), 1
#define TMR0H2                           BANKMASK(TMR0H), 2
#define TMR0H3                           BANKMASK(TMR0H), 3
#define TMR0H4                           BANKMASK(TMR0H), 4
#define TMR0H5                           BANKMASK(TMR0H), 5
#define TMR0H6                           BANKMASK(TMR0H), 6
#define TMR0H7                           BANKMASK(TMR0H), 7
#define TMR0IE                           BANKMASK(PIE0), 5
#define TMR0IF                           BANKMASK(PIR0), 5
#define TMR0L0                           BANKMASK(TMR0L), 0
#define TMR0L1                           BANKMASK(TMR0L), 1
#define TMR0L2                           BANKMASK(TMR0L), 2
#define TMR0L3                           BANKMASK(TMR0L), 3
#define TMR0L4                           BANKMASK(TMR0L), 4
#define TMR0L5                           BANKMASK(TMR0L), 5
#define TMR0L6                           BANKMASK(TMR0L), 6
#define TMR0L7                           BANKMASK(TMR0L), 7
#define TMR0MD                           BANKMASK(PMD1), 0
#define TMR1GIE                          BANKMASK(PIE5), 0
#define TMR1GIF                          BANKMASK(PIR5), 0
#define TMR1H0                           BANKMASK(TMR1H), 0
#define TMR1H1                           BANKMASK(TMR1H), 1
#define TMR1H2                           BANKMASK(TMR1H), 2
#define TMR1H3                           BANKMASK(TMR1H), 3
#define TMR1H4                           BANKMASK(TMR1H), 4
#define TMR1H5                           BANKMASK(TMR1H), 5
#define TMR1H6                           BANKMASK(TMR1H), 6
#define TMR1H7                           BANKMASK(TMR1H), 7
#define TMR1IE                           BANKMASK(PIE4), 0
#define TMR1IF                           BANKMASK(PIR4), 0
#define TMR1L0                           BANKMASK(TMR1L), 0
#define TMR1L1                           BANKMASK(TMR1L), 1
#define TMR1L2                           BANKMASK(TMR1L), 2
#define TMR1L3                           BANKMASK(TMR1L), 3
#define TMR1L4                           BANKMASK(TMR1L), 4
#define TMR1L5                           BANKMASK(TMR1L), 5
#define TMR1L6                           BANKMASK(TMR1L), 6
#define TMR1L7                           BANKMASK(TMR1L), 7
#define TMR1MD                           BANKMASK(PMD1), 1
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE4), 1
#define TMR2IF                           BANKMASK(PIR4), 1
#define TMR2MD                           BANKMASK(PMD1), 2
#define TMR2ON                           BANKMASK(T2CON), 7
#define TMR3GIE                          BANKMASK(PIE5), 1
#define TMR3GIF                          BANKMASK(PIR5), 1
#define TMR3H0                           BANKMASK(TMR3H), 0
#define TMR3H1                           BANKMASK(TMR3H), 1
#define TMR3H2                           BANKMASK(TMR3H), 2
#define TMR3H3                           BANKMASK(TMR3H), 3
#define TMR3H4                           BANKMASK(TMR3H), 4
#define TMR3H5                           BANKMASK(TMR3H), 5
#define TMR3H6                           BANKMASK(TMR3H), 6
#define TMR3H7                           BANKMASK(TMR3H), 7
#define TMR3IE                           BANKMASK(PIE4), 2
#define TMR3IF                           BANKMASK(PIR4), 2
#define TMR3L0                           BANKMASK(TMR3L), 0
#define TMR3L1                           BANKMASK(TMR3L), 1
#define TMR3L2                           BANKMASK(TMR3L), 2
#define TMR3L3                           BANKMASK(TMR3L), 3
#define TMR3L4                           BANKMASK(TMR3L), 4
#define TMR3L5                           BANKMASK(TMR3L), 5
#define TMR3L6                           BANKMASK(TMR3L), 6
#define TMR3L7                           BANKMASK(TMR3L), 7
#define TMR3MD                           BANKMASK(PMD1), 3
#define TMR3ON                           BANKMASK(T3CON), 0
#define TMR4IE                           BANKMASK(PIE4), 3
#define TMR4IF                           BANKMASK(PIR4), 3
#define TMR4MD                           BANKMASK(PMD1), 4
#define TMR4ON                           BANKMASK(T4CON), 7
#define TMR5GIE                          BANKMASK(PIE5), 2
#define TMR5GIF                          BANKMASK(PIR5), 2
#define TMR5H0                           BANKMASK(TMR5H), 0
#define TMR5H1                           BANKMASK(TMR5H), 1
#define TMR5H2                           BANKMASK(TMR5H), 2
#define TMR5H3                           BANKMASK(TMR5H), 3
#define TMR5H4                           BANKMASK(TMR5H), 4
#define TMR5H5                           BANKMASK(TMR5H), 5
#define TMR5H6                           BANKMASK(TMR5H), 6
#define TMR5H7                           BANKMASK(TMR5H), 7
#define TMR5IE                           BANKMASK(PIE4), 4
#define TMR5IF                           BANKMASK(PIR4), 4
#define TMR5L0                           BANKMASK(TMR5L), 0
#define TMR5L1                           BANKMASK(TMR5L), 1
#define TMR5L2                           BANKMASK(TMR5L), 2
#define TMR5L3                           BANKMASK(TMR5L), 3
#define TMR5L4                           BANKMASK(TMR5L), 4
#define TMR5L5                           BANKMASK(TMR5L), 5
#define TMR5L6                           BANKMASK(TMR5L), 6
#define TMR5L7                           BANKMASK(TMR5L), 7
#define TMR5MD                           BANKMASK(PMD1), 5
#define TMR5ON                           BANKMASK(T5CON), 0
#define TMR6IE                           BANKMASK(PIE4), 5
#define TMR6IF                           BANKMASK(PIR4), 5
#define TMR6MD                           BANKMASK(PMD1), 6
#define TMR6ON                           BANKMASK(T6CON), 7
#define TOSH0                            BANKMASK(TOSH), 0
#define TOSH1                            BANKMASK(TOSH), 1
#define TOSH2                            BANKMASK(TOSH), 2
#define TOSH3                            BANKMASK(TOSH), 3
#define TOSH4                            BANKMASK(TOSH), 4
#define TOSH5                            BANKMASK(TOSH), 5
#define TOSH6                            BANKMASK(TOSH), 6
#define TOSH7                            BANKMASK(TOSH), 7
#define TOSL0                            BANKMASK(TOSL), 0
#define TOSL1                            BANKMASK(TOSL), 1
#define TOSL2                            BANKMASK(TOSL), 2
#define TOSL3                            BANKMASK(TOSL), 3
#define TOSL4                            BANKMASK(TOSL), 4
#define TOSL5                            BANKMASK(TOSL), 5
#define TOSL6                            BANKMASK(TOSL), 6
#define TOSL7                            BANKMASK(TOSL), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISA6                           BANKMASK(TRISA), 6
#define TRISA7                           BANKMASK(TRISA), 7
#define TRISB0                           BANKMASK(TRISB), 0
#define TRISB1                           BANKMASK(TRISB), 1
#define TRISB2                           BANKMASK(TRISB), 2
#define TRISB3                           BANKMASK(TRISB), 3
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TRISE3                           BANKMASK(TRISE), 3
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TX1CKPPS0                        BANKMASK(TX1CKPPS), 0
#define TX1CKPPS1                        BANKMASK(TX1CKPPS), 1
#define TX1CKPPS2                        BANKMASK(TX1CKPPS), 2
#define TX1CKPPS3                        BANKMASK(TX1CKPPS), 3
#define TX1CKPPS4                        BANKMASK(TX1CKPPS), 4
#define TX1IE                            BANKMASK(PIE3), 4
#define TX1IF                            BANKMASK(PIR3), 4
#define TX2CKPPS0                        BANKMASK(TX2CKPPS), 0
#define TX2CKPPS1                        BANKMASK(TX2CKPPS), 1
#define TX2CKPPS2                        BANKMASK(TX2CKPPS), 2
#define TX2CKPPS3                        BANKMASK(TX2CKPPS), 3
#define TX2CKPPS4                        BANKMASK(TX2CKPPS), 4
#define TX2IE                            BANKMASK(PIE3), 6
#define TX2IF                            BANKMASK(PIR3), 6
#define U1MD                             BANKMASK(PMD6), 4
#define U2MD                             BANKMASK(PMD6), 5
#define UA1                              BANKMASK(SSP1STAT), 1
#define UA2                              BANKMASK(SSP2STAT), 1
#define UTH0                             BANKMASK(ADUTHL), 0
#define UTH1                             BANKMASK(ADUTHL), 1
#define UTH10                            BANKMASK(ADUTHH), 2
#define UTH11                            BANKMASK(ADUTHH), 3
#define UTH12                            BANKMASK(ADUTHH), 4
#define UTH13                            BANKMASK(ADUTHH), 5
#define UTH14                            BANKMASK(ADUTHH), 6
#define UTH15                            BANKMASK(ADUTHH), 7
#define UTH2                             BANKMASK(ADUTHL), 2
#define UTH3                             BANKMASK(ADUTHL), 3
#define UTH4                             BANKMASK(ADUTHL), 4
#define UTH5                             BANKMASK(ADUTHL), 5
#define UTH6                             BANKMASK(ADUTHL), 6
#define UTH7                             BANKMASK(ADUTHL), 7
#define UTH8                             BANKMASK(ADUTHH), 0
#define UTH9                             BANKMASK(ADUTHH), 1
#define UTHR                             BANKMASK(ADSTAT), 6
#define WCOL1                            BANKMASK(SSP1CON1), 7
#define WCOL2                            BANKMASK(SSP2CON1), 7
#define WDTCS0                           BANKMASK(WDTCON1), 4
#define WDTCS1                           BANKMASK(WDTCON1), 5
#define WDTCS2                           BANKMASK(WDTCON1), 6
#define WDTPS0                           BANKMASK(WDTCON0), 1
#define WDTPS1                           BANKMASK(WDTCON0), 2
#define WDTPS2                           BANKMASK(WDTCON0), 3
#define WDTPS3                           BANKMASK(WDTCON0), 4
#define WDTPS4                           BANKMASK(WDTCON0), 5
#define WDTPSCNT0                        BANKMASK(WDTPSL), 0
#define WDTPSCNT1                        BANKMASK(WDTPSL), 1
#define WDTPSCNT10                       BANKMASK(WDTPSH), 2
#define WDTPSCNT11                       BANKMASK(WDTPSH), 3
#define WDTPSCNT12                       BANKMASK(WDTPSH), 4
#define WDTPSCNT13                       BANKMASK(WDTPSH), 5
#define WDTPSCNT14                       BANKMASK(WDTPSH), 6
#define WDTPSCNT15                       BANKMASK(WDTPSH), 7
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1
#define WDTPSCNT2                        BANKMASK(WDTPSL), 2
#define WDTPSCNT3                        BANKMASK(WDTPSL), 3
#define WDTPSCNT4                        BANKMASK(WDTPSL), 4
#define WDTPSCNT5                        BANKMASK(WDTPSL), 5
#define WDTPSCNT6                        BANKMASK(WDTPSL), 6
#define WDTPSCNT7                        BANKMASK(WDTPSL), 7
#define WDTPSCNT8                        BANKMASK(WDTPSH), 0
#define WDTPSCNT9                        BANKMASK(WDTPSH), 1
#define WDTSEN                           BANKMASK(WDTCON0), 0
#define WDTSTATE                         BANKMASK(WDTTMR), 2
#define WDTTMR0                          BANKMASK(WDTTMR), 3
#define WDTTMR1                          BANKMASK(WDTTMR), 4
#define WDTTMR2                          BANKMASK(WDTTMR), 5
#define WDTTMR3                          BANKMASK(WDTTMR), 6
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2
#define WINDOW0                          BANKMASK(WDTCON1), 0
#define WINDOW1                          BANKMASK(WDTCON1), 1
#define WINDOW2                          BANKMASK(WDTCON1), 2
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WPUA6                            BANKMASK(WPUA), 6
#define WPUA7                            BANKMASK(WPUA), 7
#define WPUB0                            BANKMASK(WPUB), 0
#define WPUB1                            BANKMASK(WPUB), 1
#define WPUB2                            BANKMASK(WPUB), 2
#define WPUB3                            BANKMASK(WPUB), 3
#define WPUB4                            BANKMASK(WPUB), 4
#define WPUB5                            BANKMASK(WPUB), 5
#define WPUB6                            BANKMASK(WPUB), 6
#define WPUB7                            BANKMASK(WPUB), 7
#define WPUC0                            BANKMASK(WPUC), 0
#define WPUC1                            BANKMASK(WPUC), 1
#define WPUC2                            BANKMASK(WPUC), 2
#define WPUC3                            BANKMASK(WPUC), 3
#define WPUC4                            BANKMASK(WPUC), 4
#define WPUC5                            BANKMASK(WPUC), 5
#define WPUC6                            BANKMASK(WPUC), 6
#define WPUC7                            BANKMASK(WPUC), 7
#define WPUE3                            BANKMASK(WPUE), 3
#define WR                               BANKMASK(NVMCON1), 1
#define WREN                             BANKMASK(NVMCON1), 2
#define WRERR                            BANKMASK(NVMCON1), 3
#define ZCDIE                            BANKMASK(PIE2), 6
#define ZCDIF                            BANKMASK(PIR2), 6
#define ZCDINTN                          BANKMASK(ZCDCON), 0
#define ZCDINTP                          BANKMASK(ZCDCON), 1
#define ZCDMD                            BANKMASK(PMD3), 0
#define ZCDOUT                           BANKMASK(ZCDCON), 5
#define ZCDPOL                           BANKMASK(ZCDCON), 4
#define ZCDSEN                           BANKMASK(ZCDCON), 7
#define ZERO                             BANKMASK(STATUS), 2
#define nADDRESS1                        BANKMASK(SSP1STAT), 5
#define nADDRESS2                        BANKMASK(SSP2STAT), 5
#define nBOR                             BANKMASK(PCON0), 0
#define nMEMV                            BANKMASK(PCON1), 1
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON0), 1
#define nRI                              BANKMASK(PCON0), 2
#define nRMCLR                           BANKMASK(PCON0), 3
#define nRWDT                            BANKMASK(PCON0), 4
#define nTO                              BANKMASK(STATUS), 4
#define nWDTWV                           BANKMASK(PCON0), 5
#define nWRITE1                          BANKMASK(SSP1STAT), 2
#define nWRITE2                          BANKMASK(SSP2STAT), 2

